<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#groupby分组运算" data-toc-modified-id="groupby分组运算-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>groupby分组运算</a></span><ul class="toc-item"><li><span><a href="#df.groupby(分组字段)按一个字段分组" data-toc-modified-id="df.groupby(分组字段)按一个字段分组-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>df.groupby(分组字段)按一个字段分组</a></span><ul class="toc-item"><li><span><a href="#分组后的查看方式--可迭代对象通用" data-toc-modified-id="分组后的查看方式--可迭代对象通用-1.1.1"><span class="toc-item-num">1.1.1&nbsp;&nbsp;</span>分组后的查看方式--可迭代对象通用</a></span></li><li><span><a href="#gp.groups查看分组情况" data-toc-modified-id="gp.groups查看分组情况-1.1.2"><span class="toc-item-num">1.1.2&nbsp;&nbsp;</span>gp.groups查看分组情况</a></span></li><li><span><a href="#len(gp)查看分成了多少组" data-toc-modified-id="len(gp)查看分成了多少组-1.1.3"><span class="toc-item-num">1.1.3&nbsp;&nbsp;</span>len(gp)查看分成了多少组</a></span></li><li><span><a href="#gp.size()查看每组包含多少条记录" data-toc-modified-id="gp.size()查看每组包含多少条记录-1.1.4"><span class="toc-item-num">1.1.4&nbsp;&nbsp;</span>gp.size()查看每组包含多少条记录</a></span></li><li><span><a href="#gp.get_groups(某组)获得分组后的某组" data-toc-modified-id="gp.get_groups(某组)获得分组后的某组-1.1.5"><span class="toc-item-num">1.1.5&nbsp;&nbsp;</span>gp.get_groups(某组)获得分组后的某组</a></span></li><li><span><a href="#gp.mean()查看分组后各字段的平均值" data-toc-modified-id="gp.mean()查看分组后各字段的平均值-1.1.6"><span class="toc-item-num">1.1.6&nbsp;&nbsp;</span>gp.mean()查看分组后各字段的平均值</a></span></li><li><span><a href="#gp.sum()查看各字段分组后的总和" data-toc-modified-id="gp.sum()查看各字段分组后的总和-1.1.7"><span class="toc-item-num">1.1.7&nbsp;&nbsp;</span>gp.sum()查看各字段分组后的总和</a></span></li><li><span><a href="#gp.std()查看各字段分组后的标准差" data-toc-modified-id="gp.std()查看各字段分组后的标准差-1.1.8"><span class="toc-item-num">1.1.8&nbsp;&nbsp;</span>gp.std()查看各字段分组后的标准差</a></span></li><li><span><a href="#gp.var()查看各字段分组后的方差" data-toc-modified-id="gp.var()查看各字段分组后的方差-1.1.9"><span class="toc-item-num">1.1.9&nbsp;&nbsp;</span>gp.var()查看各字段分组后的方差</a></span></li></ul></li><li><span><a href="#df.groupby([字段1，-字段2，-...])按多个字段进行分组" data-toc-modified-id="df.groupby([字段1，-字段2，-...])按多个字段进行分组-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>df.groupby([字段1， 字段2， ...])按多个字段进行分组</a></span></li><li><span><a href="#groupby与agg函数的连用" data-toc-modified-id="groupby与agg函数的连用-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>groupby与agg函数的连用</a></span></li></ul></li></ul></div>

In [9]:
#全部行都能输出
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [10]:
import numpy as np
import pandas as pd

# groupby分组运算

pandas中的DataFrame对象的groupby分组和数据库的分组是一样的。

In [168]:
df = pd.DataFrame({'姓名':['小明', '小张', '小红', '小雅' , '小高',  '小周'], 
                   '性别':['男', '男', '女', '女', '男', np.nan], 
                   '语文':[80, 78, 90, 91, 79, 90], 
                   '数学':[90, 91, 93, 89, 88, 87], 
                   '英语':[78, 89, 78, 90, 67, 80]})
df

   姓名   性别  语文  数学  英语
0  小明    男  80  90  78
1  小张    男  78  91  89
2  小红    女  90  93  78
3  小雅    女  91  89  90
4  小高    男  79  88  67
5  小周  NaN  90  87  80

## df.groupby(分组字段)按一个字段分组

In [120]:
gp = df.groupby('性别')
gp   # 分组得到的是一个惰性对象， 本身不会显示任何信息

但是可以通过for循环对其进行遍历查看分组情况

### 分组后的查看方式--可迭代对象通用

In [121]:
for i in gp:
    print(i)

('女',    姓名 性别  语文  数学  英语
2  小红  女  90  93  78
3  小雅  女  91  89  90)
('男',    姓名 性别  语文  数学  英语
0  小明  男  80  90  78
1  小张  男  78  91  89
4  小高  男  79  88  67)

**能被for循环遍历的都成为可迭代对象，当然也能通过list()   tuple()函数将其转换为列表元祖等**

In [122]:
list(gp)

[('女',    姓名 性别  语文  数学  英语
  2  小红  女  90  93  78
  3  小雅  女  91  89  90), ('男',    姓名 性别  语文  数学  英语
  0  小明  男  80  90  78
  1  小张  男  78  91  89
  4  小高  男  79  88  67)]

当然也有一些其他接口

### gp.groups查看分组情况

In [123]:
gp.groups   # 索引为2 3 的是性别为女 的这组，   其余的是性别为男的这组

{'女': Int64Index([2, 3], dtype='int64'),
 '男': Int64Index([0, 1, 4], dtype='int64')}

### len(gp)查看分成了多少组

In [124]:
len(gp)

2

### gp.size()查看每组包含多少条记录

In [125]:
gp.size()

性别
女    2
男    3
dtype: int64

### gp.get_groups(某组)获得分组后的某组

In [126]:
gp.get_group('男')

   姓名 性别  语文  数学  英语
0  小明  男  80  90  78
1  小张  男  78  91  89
4  小高  男  79  88  67

In [127]:
gp.get_group('女')

   姓名 性别  语文  数学  英语
2  小红  女  90  93  78
3  小雅  女  91  89  90

**分组通常伴随着聚合函数的应用**

### gp.mean()查看分组后各字段的平均值

In [128]:
df

   姓名   性别  语文  数学  英语
0  小明    男  80  90  78
1  小张    男  78  91  89
2  小红    女  90  93  78
3  小雅    女  91  89  90
4  小高    男  79  88  67
5  小周  NaN  90  87  80

In [129]:
gp.mean()

      语文         数学    英语
性别
女   90.5  91.000000  84.0
男   79.0  89.666667  78.0

### gp.sum()查看各字段分组后的总和

In [130]:
gp.sum()

     语文   数学   英语
性别
女   181  182  168
男   237  269  234

### gp.std()查看各字段分组后的标准差

In [131]:
gp.std()

          语文        数学         英语
性别
女   0.707107  2.828427   8.485281
男   1.000000  1.527525  11.000000

### gp.var()查看各字段分组后的方差

In [132]:
gp.var()

     语文        数学     英语
性别
女   0.5  8.000000   72.0
男   1.0  2.333333  121.0

## df.groupby([字段1， 字段2， ...])按多个字段进行分组

In [133]:
df

   姓名   性别  语文  数学  英语
0  小明    男  80  90  78
1  小张    男  78  91  89
2  小红    女  90  93  78
3  小雅    女  91  89  90
4  小高    男  79  88  67
5  小周  NaN  90  87  80

我们先增加一个字段， 是**学生年级**

In [134]:
df['学生年级'] = ['初一', '初一', '初二', '初二',  '初一', '初三']
df

   姓名   性别  语文  数学  英语 学生年级
0  小明    男  80  90  78   初一
1  小张    男  78  91  89   初一
2  小红    女  90  93  78   初二
3  小雅    女  91  89  90   初二
4  小高    男  79  88  67   初一
5  小周  NaN  90  87  80   初三

将**学生年级**移到性别之后

In [135]:
df.insert(2, '学生年级', df.pop('学生年级'))

In [136]:
df

   姓名   性别 学生年级  语文  数学  英语
0  小明    男   初一  80  90  78
1  小张    男   初一  78  91  89
2  小红    女   初二  90  93  78
3  小雅    女   初二  91  89  90
4  小高    男   初一  79  88  67
5  小周  NaN   初三  90  87  80

现在按 **性别**和**学生年级**进行分组

In [137]:
gp = df.groupby(['性别', '学生年级'])
gp

In [138]:
gp.groups

{('男', '初一'): Int64Index([0, 1, 4], dtype='int64'),
 ('女', '初二'): Int64Index([2, 3], dtype='int64'),
 (nan, '初三'): Int64Index([5], dtype='int64')}

In [139]:
len(gp)  # 分成了三组

3

In [140]:
gp.size()

性别  学生年级
女   初二      2
男   初一      3
dtype: int64

In [141]:
gp.mean()

           语文         数学    英语
性别 学生年级
女  初二    90.5  91.000000  84.0
男  初一    79.0  89.666667  78.0

In [142]:
#分组依据在两个字段及以上的时候,可以设置取消索引,不用分组的字段做索引
gp = df.groupby(["性别","学生年级"],as_index=False)   #按照两个关键字进行分组
gp

In [143]:
gp.mean()

  性别 学生年级    语文         数学    英语
0  女   初二  90.5  91.000000  84.0
1  男   初一  79.0  89.666667  78.0

## groupby与agg函数的连用

In [158]:
gp = df.groupby('性别')
gp

在 DataFrame 的分组上，传递一个应用于每个列的函数列表：

In [159]:
gp.agg([np.sum, np.mean, np.std])  #  #对dataframe中所有数值型的字段进行聚合运算

     语文                   数学                        英语
    sum  mean       std  sum       mean       std  sum mean        std
性别
女   181  90.5  0.707107  182  91.000000  2.828427  168   84   8.485281
男   237  79.0  1.000000  269  89.666667  1.527525  234   78  11.000000

In [160]:
gp_rename = gp.agg([np.sum, np.mean, np.std])
gp_rename

     语文                   数学                        英语
    sum  mean       std  sum       mean       std  sum mean        std
性别
女   181  90.5  0.707107  182  91.000000  2.828427  168   84   8.485281
男   237  79.0  1.000000  269  89.666667  1.527525  234   78  11.000000

In [162]:
gp_rename.columns

MultiIndex([('语文',  'sum'),
            ('语文', 'mean'),
            ('语文',  'std'),
            ('数学',  'sum'),
            ('数学', 'mean'),
            ('数学',  'std'),
            ('英语',  'sum'),
            ('英语', 'mean'),
            ('英语',  'std')],
           )

当然也可以给分组后的某个字段单独的看多个聚合函数的情况

In [167]:
gp['数学'].agg([np.mean, np.std, np.var])

         mean       std       var
性别
女   91.000000  2.828427  8.000000
男   89.666667  1.527525  2.333333